1atabey1/esp32tricore-dap/main/network/web_server.c
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <sys/stat.h>
#include <sys/unistd.h>
#include <time.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_ota_ops.h"
#include "esp_partition.h"
#include "driver/spi_master.h"
#include "freertos/semphr.h"
#include "esp_timer.h"

#include <cJSON.h>

#include "web_server.h"
#include "network.h"
#include "descriptors.h"
#include "storage.h"
#include "network_mngr_ota.h"
#include "types.h"
#include "uart_websocket.h"
#include "../gpio_loopback_test.h"
#include "../esp32jtag_common.h"
#include "../port_cfg.h"
#include "dap_probe.h"
#include "dap_trace.h"
#include "tricore_bmp.h"
#include "tricore_flash_probe.h"
#include "tricore.h"
#include "dap_phy_fpga.h"
#include "../ice40up5k/ice.h"
#include "../version_info.h"
#include "version.h"        /* BM FIRMWARE_VERSION from blackmagic_esp32 component */
#include "mbedtls/base64.h"

static esp_err_t check_auth(httpd_req_t *req) {
    char *buf = NULL;
    size_t buf_len = 0;

    buf_len = httpd_req_get_hdr_value_len(req, "Authorization") + 1;
    if (buf_len > 1) {
        buf = calloc(1, buf_len);
        if (httpd_req_get_hdr_value_str(req, "Authorization", buf, buf_len) == ESP_OK) {
            if (strncmp(buf, "Basic ", 6) == 0) {
                char *b64 = buf + 6;
                unsigned char decoded[64] = {0};
                size_t out_len = 0;
                mbedtls_base64_decode(decoded, sizeof(decoded) - 1, &out_len, (unsigned char *)b64, strlen(b64));
                decoded[out_len] = '\0';

                char *user_nvs = NULL;
                char *pass_nvs = NULL;
                char expected[128] = {0};

                storage_alloc_and_read(WEB_USER_KEY, &user_nvs);
                storage_alloc_and_read(WEB_PASS_KEY, &pass_nvs);
                snprintf(expected, sizeof(expected), "%s:%s",
                         user_nvs ? user_nvs : "admin",
                         pass_nvs ? pass_nvs : "admin");
                free(user_nvs);
                free(pass_nvs);

                if (strcmp((char *)decoded, expected) == 0) {
                    free(buf);
                    return ESP_OK;
                }
            }
        }
        free(buf);
    }

    httpd_resp_set_hdr(req, "WWW-Authenticate", "Basic realm=\"ESP32\"");
    httpd_resp_send_err(req, HTTPD_401_UNAUTHORIZED, "Authentication Required");
    return ESP_FAIL;
}

#ifndef MIN
#define MIN(a, b) (((a) < (b)) ? (a) : (b))
#endif

//#define FPGA_CFG_TEST 1

extern void start_capture(bool without_trigger);
extern void read_capture_status(void);

#define DEFAULT_SAMPLE_RATE_HZ  264000000
uint32_t gbl_sample_rate = DEFAULT_SAMPLE_RATE_HZ;
uint8_t gbl_sample_rate_reg = 255;

/* SRESET configuration (applied by /api/sreset_config, used by reset_target_handler) */
uint8_t  gbl_sreset_polarity  = 1;    /* 0 = active HIGH, 1 = active LOW (default) */
uint32_t gbl_sreset_pulse_ms  = 100;  /* pulse width in ms */
bool gbl_trigger_enabled = true;
bool gbl_trigger_mode_or = true;
static bool gbl_la_measure_mode = false;
bool gbl_capture_internal_test_signal = false;
trigger_edge_t gbl_channel_triggers[16] = {TRIGGER_DISABLED};


//defined in main.c for comm between webserver and ice.c data capture
extern SemaphoreHandle_t capture_start_semaphore;
extern SemaphoreHandle_t capture_done_semaphore;

static const char *TAG = "web-server";

extern app_params_t g_app_params;
extern uint8_t ICE_FPGA_Config(const uint8_t *bitmap, uint32_t size);

#if 0
// A placeholder/simulation function to be replaced by actual data acquisition logic
// Example: void get_logic_analyzer_data(int num_channels, int num_samples, uint8_t **data_out);
static void get_random_logic_analyzer_data(int num_channels, int num_samples, cJSON *data_array) {
    srand(time(NULL)); // Seed the random number generator
    for (int i = 0; i < num_samples; i++) {
        cJSON *sample_array = cJSON_CreateArray();
        for (int j = 0; j < num_channels; j++) {
            cJSON_AddItemToArray(sample_array, cJSON_CreateNumber(rand() % 2));
        }
        cJSON_AddItemToArray(data_array, sample_array);
    }
}
#endif

extern uint8_t* psram_buffer;
extern void capture_data();
#define CAP_DATA_START (4)
#define HTTP_HEADER_SIZE_EST (250) // Estimate HTTP headers at 250 bytes
esp_err_t capture_data_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;
    ESP_LOGI(TAG, "=== capture_data_handler() called ===");
    ESP_LOGI(TAG, "capture_data_handler: Calling read_and_return_capture()...");
    
    // Call read_and_return_capture() to get the captured data
    extern void read_and_return_capture(void);
    read_and_return_capture();
    
    ESP_LOGI(TAG, "capture_data_handler: Data ready, sending to browser...");

    uint64_t start_time = esp_timer_get_time();
    esp_err_t ret = httpd_resp_send(req, (const char *)(psram_buffer + CAP_DATA_START), ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START);
    uint64_t end_time = esp_timer_get_time();

    // Check for errors first
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "httpd_resp_send failed with error: %d", ret);
        return ret;
    }

    uint64_t duration_us = end_time - start_time;
    // Continuation from step 1
    size_t total_bytes_sent = ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START + HTTP_HEADER_SIZE_EST;

    if (duration_us > 0) {
        // Calculate throughput in Mbps
        // Formula: (total_bytes_sent * 8 bits/byte) / duration_us (microseconds) / 1000000 (micro to mega) * 1000000 (seconds to us)
        // Simplified: (total_bytes_sent * 8) / duration_us
        // Wait, the simplified one is wrong for Mbps, let's stick to the clear one.

        // Convert duration to seconds for clear math
        double duration_s = (double)duration_us / 1000000.0;

        // Bytes per second (B/s)
        double bytes_per_sec = (double)total_bytes_sent / duration_s;

        // Megabits per second (Mbps)
        double mbps = (bytes_per_sec * 8.0) / 1000000.0;

        ESP_LOGI(TAG, "Data sent: %u bytes (+%d header)", ICE_CAPTURE_BUFFER_SIZE -CAP_DATA_START, HTTP_HEADER_SIZE_EST);
        ESP_LOGI(TAG, "Transfer time: %llu us (%.3f ms)", duration_us, duration_us / 1000.0);
        ESP_LOGI(TAG, "Calculated Wi-Fi Speed: %.2f Mbps", mbps);
    } else {
        ESP_LOGW(TAG, "Duration was zero or negative. Cannot calculate speed.");
    }

    return ret;
}

esp_err_t logic_analyzer_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    extern const unsigned char logic_analyzer_start[] asm("_binary_logic_analyzer_html_start");
    extern const unsigned char logic_analyzer_end[]   asm("_binary_logic_analyzer_html_end");
    const size_t logic_analyzer_size = (logic_analyzer_end - logic_analyzer_start);

    return httpd_resp_send(req, (const char *)logic_analyzer_start, logic_analyzer_size);
}

esp_err_t help_handler(httpd_req_t *req) {
    extern const unsigned char help_start[] asm("_binary_help_html_start");
    extern const unsigned char help_end[]   asm("_binary_help_html_end");
    const size_t help_size = (help_end - help_start);

