1atabey1/esp32tricore-dap/main/network/web_server.c
    // Determine which keys to use based on the requested mode (AP or SM)
    const char *target_ssid_key = WIFI_SSID_KEY;
    const char *target_pass_key = WIFI_PASS_KEY;
    if (wifiMode_str && strcmp(wifiMode_str, "AP") == 0) {
        target_ssid_key = WIFI_AP_SSID_KEY;
        target_pass_key = WIFI_AP_PASS_KEY;
    }

    // Check SSID & Password (relevant for both STA and AP modes now using distinct keys)
    if (wifiMode_str) {
        bool ssid_changed = false;
        bool pass_changed = false;

        if (storage_alloc_and_read(target_ssid_key, &stored_val) == ESP_OK && stored_val) {
            if (ssid_str && strcmp(stored_val, ssid_str) != 0) {
                ssid_changed = true;
                ESP_LOGI(TAG, "SSID changed for %s", wifiMode_str);
            }
            free(stored_val); stored_val = NULL;
        } else if (ssid_str && strlen(ssid_str) > 0) {
             ssid_changed = true; // First time setting or no previous value
        }

        // Check password - if empty, assume no change intended
        if (pass_str && strlen(pass_str) > 0) {
            if (storage_alloc_and_read(target_pass_key, &stored_val) == ESP_OK && stored_val) {
                if (strcmp(stored_val, pass_str) != 0) {
                    pass_changed = true;
                    ESP_LOGI(TAG, "Password changed for %s", wifiMode_str);
                }
                free(stored_val); stored_val = NULL;
            } else {
                pass_changed = true; // First time setting password
            }
        }

        if (ssid_changed || pass_changed) {
             wifi_changed = true;
             reboot_required = true;
        }
    }


    // Check for Port Configuration Changes
    if (pacfg_str && atoi(pacfg_str) != gbl_pa_cfg) {
        ESP_LOGI(TAG, "Port A config changed: %d -> %s", gbl_pa_cfg, pacfg_str);
        reboot_required = true;
    }
    if (pbcfg_str && atoi(pbcfg_str) != gbl_pb_cfg) {
        ESP_LOGI(TAG, "Port B config changed: %d -> %s", gbl_pb_cfg, pbcfg_str);
        reboot_required = true;
    }
    if (pccfg_str && atoi(pccfg_str) != gbl_pc_cfg) {
        ESP_LOGI(TAG, "Port C config changed: %d -> %s", gbl_pc_cfg, pccfg_str);
        reboot_required = true;
    }
    if (pdcfg_str && atoi(pdcfg_str) != gbl_pd_cfg) {
        ESP_LOGI(TAG, "Port D config changed: %d -> %s", gbl_pd_cfg, pdcfg_str);
        reboot_required = true;
    }

    // Check for Target Voltage Change
    if (targetVoltage_str) {
        char *stored_tv = NULL;
        if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &stored_tv) == ESP_OK && stored_tv) {
            if (strcmp(stored_tv, targetVoltage_str) != 0) {
                ESP_LOGI(TAG, "Target voltage changed: %s -> %s", stored_tv, targetVoltage_str);
                reboot_required = true;
            }
            free(stored_tv);
        } else {
            reboot_required = true;  /* key absent — first time setting */
        }
    }

    // MCU Interface is fixed to GPIO — ignore incoming value, ensure correct value stored
    {
        char *stored_mcu_if = NULL;
        if (storage_alloc_and_read(MCU_INTERFACE_KEY, &stored_mcu_if) == ESP_OK && stored_mcu_if) {
            if (strcmp(stored_mcu_if, "GPIO") != 0) {
                ESP_LOGI(TAG, "MCU Interface forced to GPIO (was %s)", stored_mcu_if);
                reboot_required = true;
            }
            free(stored_mcu_if);
        } else {
            reboot_required = true;
        }
    }

    // UART Port Selection is fixed to 1 (Web Terminal) — ignore incoming value
    {
        char *stored_uart_psel = NULL;
        if (storage_alloc_and_read(UART_PORT_SEL_KEY, &stored_uart_psel) == ESP_OK && stored_uart_psel) {
            if (strcmp(stored_uart_psel, "1") != 0) {
                ESP_LOGI(TAG, "UART Port Selection forced to Web Terminal (was %s)", stored_uart_psel);
                reboot_required = true;
            }
            free(stored_uart_psel);
        } else {
            reboot_required = true;
        }
    }

    // Check for UART changes
    if (uartBaud_str || uartDataBits_str || uartStopBits_str || uartParity_str) {
        // For simplicity, any non-null UART setting request is treated as a potential change requiring reboot/reinit.
        // In a more complex implementation, we could check against stored values, but reboot is safe.
        ESP_LOGI(TAG, "UART settings updated. Reboot required.");
        reboot_required = true;
    }

    // Disable USB DAP is fixed to true — ignore incoming value
    {
        char *stored_disable_dap = NULL;
        if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &stored_disable_dap) == ESP_OK && stored_disable_dap) {
            if (strcmp(stored_disable_dap, "1") != 0) {
                ESP_LOGI(TAG, "Disable USB DAP forced to enabled (was %s)", stored_disable_dap);
                reboot_required = true;
            }
            free(stored_disable_dap);
        } else {
            ESP_LOGI(TAG, "Disable USB DAP set for the first time (forced enabled).");
            reboot_required = true;
        }
    }

    // storage write the configurations
    storage_handle_t h;
    if (storage_open_session(&h) == ESP_OK) {
        if (pacfg_str) storage_write_session(h, PORT_A_CFG_KEY, pacfg_str, strlen(pacfg_str));
        if (pbcfg_str) storage_write_session(h, PORT_B_CFG_KEY, pbcfg_str, strlen(pbcfg_str));
        if (pccfg_str) storage_write_session(h, PORT_C_CFG_KEY, pccfg_str, strlen(pccfg_str));
        if (pdcfg_str) storage_write_session(h, PORT_D_CFG_KEY, pdcfg_str, strlen(pdcfg_str));
        if (targetVoltage_str) storage_write_session(h, TARGET_VOLTAGE_KEY, targetVoltage_str, strlen(targetVoltage_str));
        if (swMcu_str) storage_write_session(h, SW_MCU_KEY, swMcu_str, strlen(swMcu_str));
        if (wifi_changed) {
            if (wifiMode_str) storage_write_session(h, WIFI_MODE_KEY, wifiMode_str, strlen(wifiMode_str));
            if (ssid_str) storage_write_session(h, target_ssid_key, ssid_str, strlen(ssid_str));
            // Only write password if provided (non-empty), preserving existing if left blank
            if (pass_str && strlen(pass_str) > 0) storage_write_session(h, target_pass_key, pass_str, strlen(pass_str));
        }

