1atabey1/esp32tricore-dap/main/network/web_server.c
        if (otaUrl_str) storage_write_session(h, OTA_URL_KEY, otaUrl_str, strlen(otaUrl_str));
        storage_write_session(h, MCU_INTERFACE_KEY, "GPIO", 4);

        if (uartBaud_str) storage_write_session(h, UART_BAUD_KEY, uartBaud_str, strlen(uartBaud_str));
        if (uartDataBits_str) storage_write_session(h, UART_DATA_BITS_KEY, uartDataBits_str, strlen(uartDataBits_str));
        if (uartStopBits_str) storage_write_session(h, UART_STOP_BITS_KEY, uartStopBits_str, strlen(uartStopBits_str));
        if (uartParity_str) storage_write_session(h, UART_PARITY_KEY, uartParity_str, strlen(uartParity_str));
        storage_write_session(h, UART_PORT_SEL_KEY, "1", 1);
        storage_write_session(h, DISABLE_USB_DAP_KEY, "1", 1);

        storage_close_session(h);
    }

    cJSON_Delete(root);

    if (reboot_required) {
        httpd_resp_sendstr(req, "Critical settings changed. Rebooting...");
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        esp_restart();
    } else {
        httpd_resp_sendstr(req, "Settings saved.");
        void set_cfg_after_settings_change(void);
        set_cfg_after_settings_change();
    }

    return ESP_OK;
}

void set_cfg_after_settings_change(void)
{
    ESP_LOGI(TAG, "Configuration updated. Applying changes without reboot...");
    // TODO: Implement dynamic configuration update logic here
}

esp_err_t get_credentials_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    cJSON *root = cJSON_CreateObject();
    char *val = NULL;

    // --- Port Configs ---
    if (storage_alloc_and_read(PORT_A_CFG_KEY, &val) == ESP_OK && val) {
        if(strcmp(val, "1") == 0) {
            cJSON_AddStringToObject(root, "pacfg", "0");
        } else {
            cJSON_AddStringToObject(root, "pacfg", val);
        }
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pacfg", "0"); // Default
    }

    if (storage_alloc_and_read(PORT_B_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pbcfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pbcfg", "0");
    }

    if (storage_alloc_and_read(PORT_C_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pccfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pccfg", "0");
    }

    if (storage_alloc_and_read(PORT_D_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pdcfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pdcfg", "0");
    }

    // --- Other Settings ---
    if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "targetVoltage", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "targetVoltage", "0");
    }

    if (storage_alloc_and_read(SW_MCU_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "swMcu", val);
        free(val); val = NULL;
    } else {
         cJSON_AddStringToObject(root, "swMcu", "0");
    }

    // --- WiFi ---
    // Station Mode SSID
    char *ssid_st = NULL;
    if (storage_alloc_and_read(WIFI_SSID_KEY, &ssid_st) == ESP_OK && ssid_st) {
        cJSON_AddStringToObject(root, "ssid_st", ssid_st);
    } else {
        cJSON_AddStringToObject(root, "ssid_st", "");
    }

    // AP Mode SSID
    char *ssid_ap = NULL;
    if (storage_alloc_and_read(WIFI_AP_SSID_KEY, &ssid_ap) == ESP_OK && ssid_ap) {
        cJSON_AddStringToObject(root, "ssid_ap", ssid_ap);
    } else {
        cJSON_AddStringToObject(root, "ssid_ap", ""); // Or default WIFI_AP_SSSID if we want to show default
    }

    // Populate generic 'ssid' for backward compatibility / initial view
    if (g_app_params.mode == APP_MODE_STA) {
        cJSON_AddStringToObject(root, "ssid", ssid_st ? ssid_st : "");
    } else {
        // If AP custom ssid exists, use it, else default
        if (ssid_ap) {
            cJSON_AddStringToObject(root, "ssid", ssid_ap);
        } else {
            cJSON_AddStringToObject(root, "ssid", WIFI_AP_SSSID);
        }
    }

    if (ssid_st) free(ssid_st);
    if (ssid_ap) free(ssid_ap);
     // Don't send password back
    cJSON_AddStringToObject(root, "password", "");

    // Use runtime mode to reflect actual status
    if (g_app_params.mode == APP_MODE_STA) {
        cJSON_AddStringToObject(root, "wifiMode", "SM");
    } else {
        cJSON_AddStringToObject(root, "wifiMode", "AP");
    }
    // Note: We intentionally ignore the stored WIFI_MODE_KEY here to avoid
    // discrepancies when fallback logic forces AP mode but NVS still has "SM".

    if (storage_alloc_and_read(OTA_URL_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "otaUrl", val);
        free(val); val = NULL;
    } else {
         cJSON_AddStringToObject(root, "otaUrl", "");
    }

    // Fixed values: MCU interface is always GPIO, UART always Web Terminal
    cJSON_AddStringToObject(root, "mcuInterface", "GPIO");
    cJSON_AddStringToObject(root, "uartPortSel", "1");

    // --- UART Settings ---
    if (storage_alloc_and_read(UART_BAUD_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartBaud", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartBaud", "115200");
    }

    if (storage_alloc_and_read(UART_DATA_BITS_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartDataBits", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartDataBits", "8");
    }

    if (storage_alloc_and_read(UART_STOP_BITS_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartStopBits", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartStopBits", "1");
    }

    if (storage_alloc_and_read(UART_PARITY_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartParity", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartParity", "n"); // 'n' for None
    }

