1atabey1/esp32tricore-dap/main/network/web_server.c
    return err;
}
#endif

static esp_err_t log_error_handler(httpd_req_t *req)
{
    char json_buf[128];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) {
        return ESP_FAIL;
    }

    cJSON *message = cJSON_GetObjectItemCaseSensitive(root, "message");
    if (cJSON_IsString(message) && (message->valuestring != NULL)) {
        ESP_LOGE(TAG, "Client-side Error: %s", message->valuestring);
    } else {
        ESP_LOGE(TAG, "Client sent an unreadable error message.");
    }
    
    cJSON_Delete(root);
    
    // Respond to the client to confirm receipt
    httpd_resp_sendstr(req, "Error logged successfully.");

    return ESP_OK;
}

static esp_err_t la_start_capture_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    ESP_LOGI(TAG, "=== la_start_capture_handler() called ===");
    
    // A C-style string buffer to hold the JSON response
    char resp_buf[128];

    // Set flags and call start_capture()
    gbl_capture_started = true;
    gbl_triggered_flag = false;
    gbl_all_captured_flag = false;
    
    ESP_LOGI(TAG, "la_start_capture_handler: Calling start_capture(false)...");
    extern void start_capture(bool without_trigger);
    start_capture(false);
    ESP_LOGI(TAG, "la_start_capture_handler: start_capture() completed");
    
    // Format the JSON string
    // We explicitly return "true" for capture_started because we just called start_capture()
    // and we don't want to rely on gbl_capture_started which might be cleared by the 
    // background thread (race condition).
    snprintf(resp_buf, sizeof(resp_buf), "{\"capture_started\": true, \"triggered\": %s, \"all_captured\": %s}",
             gbl_triggered_flag ? "true" : "false",
             gbl_all_captured_flag? "true" : "false");

    // Set the content type header
    httpd_resp_set_type(req, "application/json");

    // Send the response
    httpd_resp_send(req, resp_buf, HTTPD_RESP_USE_STRLEN);

    ESP_LOGI(TAG, "la_start_capture_handler: Response sent: '%s'", resp_buf);
    return ESP_OK;
}

// ==============================================================================
// TEST AUTOMATION LOGIC (Stubs/Implementation)
// ==============================================================================

static char g_current_test_name[32] = {0};
static char g_test_status[16] = "idle"; // idle, running, done
static char g_test_result_json[512] = "{}";
static bool g_test_is_running = false;

// Stub functions simulating hardware tests
void run_test_input(void) {
    ESP_LOGI(TAG, "Running test_input...");
    vTaskDelay(pdMS_TO_TICKS(1000)); // Simulate test duration
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_input\", \"result\": \"pass\", \"details\": \"Input pins verified\"}");
}

void run_test_output(void) {
    ESP_LOGI(TAG, "Running test_output...");
    vTaskDelay(pdMS_TO_TICKS(1000));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_output\", \"result\": \"pass\", \"details\": \"Output pins toggled\"}");
}

void run_test_ad(void) {
    ESP_LOGI(TAG, "Running test_ad...");
    vTaskDelay(pdMS_TO_TICKS(1500));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_ad\", \"result\": \"pass\", \"details\": \"ADC values within range\"}");
}

void run_test_iovoltage(void) {
    ESP_LOGI(TAG, "Running test_iovoltage...");
    vTaskDelay(pdMS_TO_TICKS(500));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_iovoltage\", \"result\": \"pass\", \"voltage\": \"3.3V\"}");
}

void run_test_uart(void) {
    ESP_LOGI(TAG, "Running test_uart...");
    vTaskDelay(pdMS_TO_TICKS(2000));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_uart\", \"result\": \"pass\", \"details\": \"Loopback successful\"}");
}

void run_test_gpio_loopback(void) {
    ESP_LOGI(TAG, "Running test_gpio_loopback...");
    gpio_loopback_test_run_json(g_test_result_json, sizeof(g_test_result_json));
}

void run_test_targetin_detect(void) {
    ESP_LOGI(TAG, "Running test_targetin_detect...");
    gpio_targetin_detect_run_json(g_test_result_json, sizeof(g_test_result_json));
}

void run_test_uart_rxd_detect(void) {
    ESP_LOGI(TAG, "Running test_uart_rxd_detect...");
    gpio_uart_rxd_detect_run_json(g_test_result_json, sizeof(g_test_result_json));
}

// Task that executes the test
void test_runner_task(void *pvParameters) {
    char *test_name = (char *)pvParameters;

    ESP_LOGI(TAG, "Test runner started for: %s", test_name);
    snprintf(g_test_status, sizeof(g_test_status), "running");

    if (strcmp(test_name, "test_input") == 0) run_test_input();
    else if (strcmp(test_name, "test_output") == 0) run_test_output();
    else if (strcmp(test_name, "test_ad") == 0) run_test_ad();
    else if (strcmp(test_name, "test_iovoltage") == 0) run_test_iovoltage();
    else if (strcmp(test_name, "test_uart") == 0) run_test_uart();
    else if (strcmp(test_name, "test_gpio_loopback") == 0) run_test_gpio_loopback();
    else if (strcmp(test_name, "test_targetin_detect") == 0) run_test_targetin_detect();
    else if (strcmp(test_name, "test_uart_rxd_detect") == 0) run_test_uart_rxd_detect();
    else {
        ESP_LOGE(TAG, "Unknown test type: %s", test_name);
        snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"%s\", \"result\": \"error\", \"details\": \"Unknown test type\"}", test_name);
    }

    snprintf(g_test_status, sizeof(g_test_status), "done");
    g_test_is_running = false;
    free(test_name); // Free the allocated string
    vTaskDelete(NULL);
}

// Handler: /test/start
static esp_err_t test_start_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "test_start_handler called");
    //if (check_auth(req) != ESP_OK) {
    //    ESP_LOGW(TAG, "check_auth(req) failed");
    //    //return ESP_OK;
    //}

    if (g_test_is_running) {
        ESP_LOGW(TAG, "test_start_handler: Test already running");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "A test is already running");
        return ESP_FAIL;
    }

    char json_buf[128];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) return ESP_FAIL;

    cJSON *test_type_item = cJSON_GetObjectItem(root, "test_type");
    if (!cJSON_IsString(test_type_item) || (test_type_item->valuestring == NULL)) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing or invalid 'test_type'");
        return ESP_FAIL;
    }

    // Allocate memory for the test name to pass to the task
    char *test_name_param = strdup(test_type_item->valuestring);
    snprintf(g_current_test_name, sizeof(g_current_test_name), "%s", test_type_item->valuestring);
    cJSON_Delete(root);

    ESP_LOGI(TAG, "Starting test: %s", g_current_test_name);

    g_test_is_running = true;
    xTaskCreate(test_runner_task, "test_runner", 4096, test_name_param, 5, NULL);

