1atabey1/esp32tricore-dap/main/network/web_server.c
    dap_capture_begin();
    err = dap_probe_bringup_report();
    dap_capture_end(req, err == ESP_OK
        ? "\n=== DAP bring-up PASSED ===\n"
        : "\n=== DAP bring-up did not complete ===\n");
    return ESP_OK;
}

/*
 * GET /api/dap_spi - Phase 1c: run the same checkpoints with GP-SPI clocking,
 * then measure both backends.  Separate from /api/dap_bringup because the
 * bit-bang result is the reference the SPI numbers are compared against, and
 * because a failed SPI experiment reverts rather than sticking.
 */
static esp_err_t dap_spi_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    esp_err_t err = dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ);
    if (err != ESP_OK) {
        httpd_resp_set_status(req, "503 Service Unavailable");
        httpd_resp_sendstr(req, "DAP PHY unavailable on this board");
        return ESP_OK;
    }

    dap_capture_begin();
    err = dap_probe_spi_bringup();
    dap_capture_end(req, err == ESP_OK
        ? "\n=== GP-SPI backend PASSED ===\n"
        : "\n=== GP-SPI backend did not pass ===\n");
    return ESP_OK;
}

/*
 * GET /api/dap_trace/start  - attach, enable OCDS, and start the drain
 * GET /api/dap_trace/stop
 * GET /api/dap_trace/stats  - one line of counters
 * GET /api/dap_trace/stream - the drained stream as it arrives
 *
 * The stream is binary and self-framing: every paragraph carries a
 * dap_trace_record_t header with a magic word, a sequence number, and a gap
 * flag counting the paragraphs the target overwrote before the probe could
 * read them.  That last part is the point of the whole exercise - a TRAM lap
 * produces no ERR message, so a stream without an explicit marker parses as
 * valid and is quietly wrong.
 *
 * Nothing here configures tracing.  The MCDS configuration is the host's
 * 54-write list; a drain that invented its own would be measuring itself.
 */
static esp_err_t dap_trace_start_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    esp_err_t err = dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ);
    if (err != ESP_OK) {
        httpd_resp_set_status(req, "503 Service Unavailable");
        httpd_resp_sendstr(req, "DAP PHY unavailable on this board\n");
        return ESP_OK;
    }

    /*
     * The same opening the bring-up uses, because the drain needs exactly what
     * it establishes: an attached device, the Cerberus IOClient selected, RW
     * mode for bus access, and OCDS on - without which the whole miniMCDS
     * register space bus-errors and the FIFO reads come back empty.
     */
    dap_capture_begin();

    dap_exchange_t x;
    err = dap_probe_attach(&x, 3);
    if (err == ESP_OK) {
        dap_probe_client_set(1, &x);
        dap_probe_clear_error_state();
        dap_probe_set_rw_mode(true);
        dap_probe_enable_ocds();
        err = dap_trace_start();
    }
    dap_capture_end(req, err == ESP_OK
        ? "\n=== draining ===\n"
        : "\n=== could not start the drain ===\n");
    return ESP_OK;
}

static esp_err_t dap_trace_stop_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_trace_stop();
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_sendstr(req, "stopped\n");
    return ESP_OK;
}

static esp_err_t dap_trace_stats_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_trace_stats_t st;
    char line[384];

    dap_trace_get_stats(&st);
    const int n = snprintf(line, sizeof(line),
        "running=%d paragraphs=%" PRIu32 " bytes=%" PRIu32 " lost=%" PRIu32
        " laps=%" PRIu32 " overruns=%" PRIu32 " read_errors=%" PRIu32
        " fifonow=0x%08" PRIX32 " queue_free=%" PRIu32 " queue_dropped=%" PRIu32
        " poll_us_max=%" PRIu32 "\n",
        st.running ? 1 : 0, st.paragraphs, st.bytes, st.lost, st.laps,
        st.overruns, st.read_errors, st.fifonow, st.queue_free,
        st.queue_dropped, st.poll_us_max);

    httpd_resp_set_type(req, "text/plain");
    httpd_resp_send(req, line, (n > 0) ? (size_t)n : 0);
    return ESP_OK;
}

static esp_err_t dap_trace_stream_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    /*
     * Chunked, and deliberately bounded rather than held open forever.
     *
     * esp_http_server services every request from one task, so a handler that
     * streams until the capture ends blocks the whole web server while it runs
     * - including /api/dap_trace/stop, which would leave no way to stop the
     * drain but a reset.  So this returns after DAP_TRACE_STREAM_MAX_MS, or
     * sooner if the ring goes quiet, and the host reconnects.  The 64 kB ring
     * covers the gap between requests.
     *
     * That bound is also the limit of this transport.  A sustained three-signal
     * capture is about 400 kB/s, which fills the ring in roughly 160 ms, so a
     * host that takes longer than that to reconnect loses paragraphs - and they
     * are reported as gaps rather than lost silently, which is the point of the
     * record header.  Sustained capture wants a dedicated socket with its own
     * task; this endpoint is for bring-up and for verifying the framing.
     */
    const int64_t deadline = esp_timer_get_time() + DAP_TRACE_STREAM_MAX_MS * 1000;

    uint8_t *buf = heap_caps_malloc(DAP_TRACE_CHUNK_BYTES,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (buf == NULL) {
        buf = heap_caps_malloc(DAP_TRACE_CHUNK_BYTES, MALLOC_CAP_8BIT);
    }
    if (buf == NULL) {
        httpd_resp_set_status(req, "503 Service Unavailable");
        httpd_resp_sendstr(req, "no buffer for the stream\n");
        return ESP_OK;
    }
    httpd_resp_set_type(req, "application/octet-stream");

    int idle = 0;
    for (;;) {
        const size_t n = dap_trace_read(buf, DAP_TRACE_CHUNK_BYTES);

        if (n) {
            idle = 0;
            if (httpd_resp_send_chunk(req, (const char *)buf, n) != ESP_OK) {
                break;                  /* the host went away */
            }
            if (esp_timer_get_time() >= deadline) {
                break;                  /* hand the server back; the host returns */
            }
            continue;                   /* there may be more waiting already */
        }

