1atabey1/esp32tricore-dap/main/network/web_server.c
    /*
     * Drive the clock and data pins by hand and report what comes back, so a
     * pass-through bitstream can prove which ESP32 pin reaches which FPGA pad.
     * The MISO mapping was confirmed this way; SCK and MOSI never were, and an
     * unverified assumption there looks exactly like a slave that ignores the
     * clock.  gpio_config, not gpio_set_direction: only the former puts the
     * pad's IO_MUX back to GPIO after the SPI peripheral has had it.
     */
    const gpio_config_t drive = {
        .mode         = GPIO_MODE_OUTPUT,
        .pin_bit_mask = (1ULL << AEL_PIN_NUM_CLK) | (1ULL << AEL_PIN_NUM_MOSI),
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&drive);

    int miso_clk[2], miso_mosi[2];
    for (int level = 0; level < 2; level++) {
        gpio_set_level(AEL_PIN_NUM_CLK, level);
        gpio_set_level(AEL_PIN_NUM_MOSI, 0);
        esp_rom_delay_us(50);
        miso_clk[level] = gpio_get_level(AEL_PIN_NUM_MISO);

        gpio_set_level(AEL_PIN_NUM_CLK, 0);
        gpio_set_level(AEL_PIN_NUM_MOSI, level);
        esp_rom_delay_us(50);
        miso_mosi[level] = gpio_get_level(AEL_PIN_NUM_MISO);
    }
    gpio_set_level(AEL_PIN_NUM_CLK, 0);
    gpio_set_level(AEL_PIN_NUM_MOSI, 0);

    char line[224];
    const int n = snprintf(line, sizeof(line),
        "miso_gpio%d=%d cdone_gpio42=%d  clk_drive[0,1]->miso[%d,%d]  "
        "mosi_drive[0,1]->miso[%d,%d]\n",
        AEL_PIN_NUM_MISO, gpio_get_level(AEL_PIN_NUM_MISO), gpio_get_level(42),
        miso_clk[0], miso_clk[1], miso_mosi[0], miso_mosi[1]);

    httpd_resp_set_type(req, "text/plain");
    httpd_resp_send(req, line, (n > 0) ? (size_t)n : 0);
    return ESP_OK;
}

httpd_uri_t uri_fpga_pins = {
    .uri      = "/api/fpga_pins",
    .method   = HTTP_GET,
    .handler  = fpga_pins_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_fpga_load = {
    .uri      = "/api/fpga_load",
    .method   = HTTP_POST,
    .handler  = fpga_load_handler,
    .user_ctx = NULL
};

/*
 * GET /api/dap_fpga - bring the fabric DAP master up and prove the route.
 *
 * Checked in the order that makes a failure name itself: the register file
 * answers at all, then a sync frame comes back, then a block read matches what
 * the CPU path reads from the same address.  The last one is the point - it is
 * the same data by two independent routes.
 */
static esp_err_t dap_fpga_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_capture_begin();
    const esp_err_t err = dap_probe_fpga_route_check();
    dap_capture_end(req, err == ESP_OK
        ? "\n=== the fabric route works ===\n"
        : "\n=== the fabric route did not come up ===\n");
    return ESP_OK;
}

httpd_uri_t uri_dap_fpga = {
    .uri      = "/api/dap_fpga",
    .method   = HTTP_GET,
    .handler  = dap_fpga_handler,
    .user_ctx = NULL
};

/*
 * GET /api/dap_gdb/attach - register the TC3xx as a Black Magic Probe target
 * GET /api/dap_gdb/status
 *
 * There is no second GDB server.  Black Magic's is already listening on 4242
 * and already implements everything above the target; this only registers the
 * cores in its target list, after which
 *
 *     (gdb) target extended-remote <board>:4242
 *     (gdb) attach 1
 *
 * works.  On request rather than at boot because attaching drives Port C, and
 * doing that unasked while somebody is using the probe for something else is
 * how the target ends up held in reset.
 */
static esp_err_t dap_gdb_attach_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_capture_begin();
    const esp_err_t err = tricore_bmp_probe();
    dap_capture_end(req, err == ESP_OK
        ? "\n=== registered; target extended-remote <board>:4242, then attach 1 ===\n"
        : "\n=== could not attach to the target ===\n");
    return ESP_OK;
}

static esp_err_t dap_gdb_status_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    char   line[256];
    size_t n = 0;

    n += (size_t)snprintf(line + n, sizeof(line) - n, "cores=%d",
                          tricore_core_count());
    for (int i = 0; i < tricore_core_count(); i++) {
        const int core = tricore_core_index(i);
        n += (size_t)snprintf(line + n, sizeof(line) - n, " cpu%d=%s", core,
                              tricore_is_halted(core) ? "halted" : "running");
    }
    n += (size_t)snprintf(line + n, sizeof(line) - n, "\n");

    httpd_resp_set_type(req, "text/plain");
    httpd_resp_send(req, line, n);
    return ESP_OK;
}

/*
 * GET /api/dap_flash_probe - can this probe load a flash page?
 *
 * The one open question standing between GDB `load` and this target.  Writes
 * nothing to flash; see tricore_flash_probe.c for what it does and why that is
 * safe.  Needs /api/dap_gdb/attach first, for the cores.
 */
static esp_err_t dap_flash_probe_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_capture_begin();
    const esp_err_t err = tricore_flash_probe_width();
    dap_capture_end(req, err == ESP_OK
        ? "\n=== a page load was accepted; flashing can come across ===\n"
        : "\n=== no page load was accepted; flashing stays on DAS ===\n");
    return ESP_OK;
}

httpd_uri_t uri_dap_flash_probe = {
    .uri      = "/api/dap_flash_probe",
    .method   = HTTP_GET,
    .handler  = dap_flash_probe_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_gdb_attach = {
    .uri      = "/api/dap_gdb/attach",
    .method   = HTTP_GET,
    .handler  = dap_gdb_attach_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_gdb_status = {
    .uri      = "/api/dap_gdb/status",
    .method   = HTTP_GET,
    .handler  = dap_gdb_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_start = {
    .uri      = "/api/dap_trace/start",
    .method   = HTTP_GET,
    .handler  = dap_trace_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stop = {
    .uri      = "/api/dap_trace/stop",
    .method   = HTTP_GET,
    .handler  = dap_trace_stop_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stats = {
    .uri      = "/api/dap_trace/stats",
    .method   = HTTP_GET,
    .handler  = dap_trace_stats_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stream = {
    .uri      = "/api/dap_trace/stream",
    .method   = HTTP_GET,
    .handler  = dap_trace_stream_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_spi = {
    .uri      = "/api/dap_spi",
    .method   = HTTP_GET,
    .handler  = dap_spi_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_bringup = {
    .uri      = "/api/dap_bringup",
    .method   = HTTP_GET,
    .handler  = dap_bringup_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_reset_to_factory = {
    .uri       = "/reset_to_factory",
    .method    = HTTP_POST,
    .handler   = reset_to_factory_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_ota_upload = {
    .uri      = "/ota_upload",
    .method   = HTTP_POST,
#ifndef FPGA_CFG_TEST 
    .handler  = ota_upload_handler,
#else
    .handler  = fpga_loader_handler,
#endif
    .user_ctx = NULL
};

